{
    "id": 1,
    "image": {
        "name": "Victor Pogodin",
        "data": "../assets/images/proj.jpg"
    },
    "buttons": [
        {
            "type": "explore",
            "link": "http://maykor.com/en/"
        },
        {
            "type": "picture_as_pdf",
            "link": "../assets/pdf/Alexander_Tsema_Resume.pdf"
        }
    ],
    "title": "Victor Pogodin",
    "subtitle": "Head of Automation at MAYKOR",
    "text": "<p>I have known Alexander Tsema for about two years since 2014. I worked as the Head of Automation Department for MAYKOR Company, St. Petersburg branch and Alexander reported to me in the position of Middle C# Developer. MAYKOR is a leading Russian provider of IT and business process outsourcing services with extensive network of branches and delivery centers across Russia. The Automation Department served companies from key sectors such as: retail, oil and gas, finance, telecommunications, manufacturing and the public sector. Our team provided customers with Web Services, Web Applications and Desktop Enterprise Applications Development. Alexander worked as a Business Logic Developer (based on C#), Front End Developer and Data Base Architect. He also took part in gathering requirements for projects and creating functional specification. Alexander performed as a well-rounded IT professional, he has got the qualification of Bachelor of Engineering and Technology in the field of study Computer Science and Computer Engineering at St. Petersburg National Research University of Information Technologies, Mechanics and Optics (ITMO University). During the time we worked as a team, I was impressed by his strong professional skills in C#,Web API, ASP.Net MVC, MS SQL, Entity Framework, REST/SOAP and WCF. Alexander is very innovative, he brought some fresh ideas to our team and we started to use a new approach of software development and new modern technologies and concepts were put to work at our department. We highly appreciate his input into our business. He has the ability to plan, organize and prioritize the tasks, display the initiative and creativity in solving issues, work under pressure and adhere to deadlines. Alexander is a great team player with ability to form excellent working relationships at all levels. He is able to handle varied situations with tact and it was really a pleasure to work with Alexander. As his manager I highly recommend Alexander Tsema as a valuable well-rounded IT professional. If you have any  further questions, please do not hesitate to contact me by phone or email mentioned above.</p>"
}